Revit 2027 API
ParameterTypeId.StructuralAttachmentTopReferencedend Property
 "Top Attachment Referenced End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentTopReferencedend { get; }
Public Shared ReadOnly Property StructuralAttachmentTopReferencedend As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentTopReferencedend {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentTopReferencedend : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace